src/cf/Catalogs/ВнутренниеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ВнутренниеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПеречислениеСогласован</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВнутренниеДокументы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьОбязательностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательностьПолей()
	
	Если Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыДокументов.Договор") Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбязательностьПолей();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Согласован.Доступность = РольДоступна("СогласованиеДокументов");
	
	Если Не Объект.Подразделение.Пустая() Тогда
		ТекущийПользователь = ОбщийМодульСистема.ПолучитьТекущегоПользователя();
		РуководительПодразделения = Объект.Подразделение.Руководитель;
		Элементы.Согласован.Доступность = Элементы.Согласован.Доступность Или (ТекущийПользователь = РуководительПодразделения);
	КонецЕсли;
КонецПроцедуры
